app/controllers/posts_controller.rb

  def create
    @post = Post.new(post_params)

    respond_to do |format|
      if @post.save
---
INSERT INTO "posts" ("name", "title", "content", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "kwefmclkm"], ["title", "copmefcmjfewpjofwemf"], ["content", "dcekwpocmdefkpoef"], ["created_at", "2022-12-04 22:45:52.037862"], ["updated_at", "2022-12-04 22:45:52.037862"]]